# SectionModulus Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SectionModulus Property
SpecTypeId Class See Also
---
Section Modulus, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SectionModulus { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionModulus As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionModulus {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace